# PipingVelocity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingVelocity Property
SpecTypeId Class See Also
---
Velocity, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingVelocity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingVelocity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingVelocity {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace